Load dataset

In [1]:
import pandas as pd
from sklearn.preprocessing import MinMaxScaler

house_df = pd.read_csv("house_scores.csv")
job_df = pd.read_csv("job_scores.csv")

#Original datasets used to restore unscaled values for display and filtering
house_raw = pd.read_csv("house_data_cleaned.csv")
#Normalize numeric columns in the raw house data
house_raw['Price'] = house_raw['Price'].astype(str).str.replace(',','').str.replace('"','').str.strip()
house_raw['Price'] = pd.to_numeric(house_raw['Price'], errors='coerce')
house_raw['Size'] = house_raw['Size'].astype(str).str.replace(',','').str.replace('"','').str.strip()
house_raw['Size'] = pd.to_numeric(house_raw['Size'], errors='coerce')
house_raw['Number of beds'] = pd.to_numeric(house_raw['Number of beds'], errors='coerce')
house_raw['Number of bathrooms'] = pd.to_numeric(house_raw['Number of bathrooms'], errors='coerce')

In [2]:
house_df.head()

,Name,Price,Size,Number of beds,Number of bathrooms,Type,Furnished Status,Location,District,State,Facilities,Public transport,Price_numeric,Price_Category,Type_grouped,Price_inv,house_score,lr_pred_score,lr_residual
0,"Putra Heights, Selangor",0.001175,0.01399,0.333333,0.222222,2-storey Terraced House,Fully Furnished,"Putra Heights, Selangor",Putra Heights,Selangor,"Parking, Playground, Jogging Track",False,2200,2000-3000,Terraced House,0.998825,0.371270,0.372470,-0.001201
1,"I-Santorini, Tanjong Tokong, Penang",0.000786,0.00849,0.222222,0.111111,Condominium,Partially Furnished,"Jalan Seri Tanjung Pinang 1, Seri Tanjung Pina...",Tanjong Tokong,Penang,"Parking, Security, Lift, Swimming Pool, Playgr...",False,1500,1000-2000,Condominium,0.999214,0.324997,0.324264,0.000734
2,"Puncak Alam, Selangor",0.000953,0.01199,0.333333,0.222222,2-storey Terraced House,Not Furnished,"Puncak Alam, Selangor",Puncak Alam,Selangor,"Parking, Playground, Minimart",False,1800,1000-2000,Terraced House,0.999047,0.370625,0.371262,-0.000637
3,"Simfoni 1, Semenyih, Selangor",0.000786,0.01072,0.222222,0.111111,Condominium,Fully Furnished,"Jalan 3/20, Bandar Teknologi Kajang, 43500 Sem...",Semenyih,Selangor,"Parking, Security, Lift, Swimming Pool, Playgr...",False,1500,1000-2000,Condominium,0.999214,0.325778,0.325677,0.000101
4,"Legend Height, Segambut, Kuala Lumpur",0.001231,0.01049,0.222222,0.111111,Service Residence,Partially Furnished,"Jalan Udang Siar 2, Taman Sri Segambut, 52000 ...",Segambut,Kuala Lumpur,"Parking, Security, Lift, Swimming Pool, Playgr...",False,2300,2000-3000,Serviced Apartment,0.998769,0.325586,0.325456,0.000130

In [3]:
job_df.head()

,job_id,title,company,location,salary,contractType,source,state,district,contract_type_name,contract_type_id,salary_category,title_cluster,salary_norm,title_cluster_score,contract_score,job_score,lr_residual,lr_pred_score
0,b6a7eadc30d542b2af6e87a730045cb8,CONSULTANT NAARABELLE FACESPA- ALOR SETAR,NAARA FACESPA SDN BHD,"{'STATE': 'MY_KDH', 'CITY': 'MY_KDH_alor_setar...",2500,"{'id': '1', 'name': 'Permanent'}",MyFutureJobs,Kedah,Alor Setar,Permanent,1,1500-3000,-1,0.008333,0.011036,1.0,0.518694,-0.000569,0.519263
1,96ff1bf3106444a4886e76c203ef954c,GENERAL WORKER,Singhap (Kedah) Sdn Bhd,"{'COUNTRY': 'MY', 'STATE': 'MY_KDH', 'CITY': '...",1700,"{'id': '1', 'name': 'Permanent'}",MyFutureJobs,Kedah,Alor Setar,Permanent,1,1500-3000,52,0.005667,0.027192,1.0,0.613590,0.018953,0.594636
2,7bc5175af9324b1fbede14967050da0c,Supervision,MERIDIAN WORLD SDN BHD,"{'COUNTRY': 'MY', 'STATE': 'MY_KDH', 'CITY': '...",2000,"{'id': '1', 'name': 'Permanent'}",MyFutureJobs,Kedah,Sungai Petani,Permanent,1,1500-3000,-1,0.006667,0.011036,1.0,0.477028,-0.000949,0.477976
3,604dab81729144d1b3ba3f4ec4b0d51d,Assistant Cafe Manager - Aurelius Hospital Alo...,O'Briens Irish Sandwich Bars (Shinning Continu...,"{'STATE': 'MY_KDH', 'CITY': 'MY_KDH_alor_setar...",2800,"{'id': '1', 'name': 'Permanent'}",MyFutureJobs,Kedah,Alor Setar,Permanent,1,1500-3000,-1,0.009333,0.011036,1.0,0.543694,-0.000596,0.544290
4,ee6f56c1e3db49e0912a27bd7db4c13b,"ACCOUNT, AUDIT AND TAX",SS Management Services,"{'STATE': 'MY_KDH', 'CITY': 'MY_KDH_jitra', 'P...",1700,"{'id': '1', 'name': 'Permanent'}",MyFutureJobs,Kedah,Jitra,Permanent,1,1500-3000,-1,0.005667,0.011036,1.0,0.452028,0.002570,0.449457

Aggregate the scores by district and states

In [4]:
house_agg = (
    house_df
    .groupby(["State", "District"])
    .agg(
        avg_house_score=("house_score", "mean"),
        house_count=("house_score", "count")
    )
    .reset_index()
)

job_agg = (
    job_df
    .groupby(["state", "district"])
    .agg(
        avg_job_score=("job_score", "mean"),
        job_count=("job_score", "count")
    )
    .reset_index()
)

In [5]:
house_agg.info()
job_agg.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 407 entries, 0 to 406
Data columns (total 4 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   State            407 non-null    object
 1   District         407 non-null    object
 2   avg_house_score  407 non-null    float64
 3   house_count      407 non-null    int64
dtypes: float64(1), int64(1), object(2)
memory usage: 12.8+ KB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 267 entries, 0 to 266
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   state          267 non-null    object
 1   district       267 non-null    object
 2   avg_job_score  267 non-null    float64
 3   job_count      267 non-null    int64
dtypes: float64(1), int64(1), object(2)
memory usage: 8.5+ KB

In [6]:
#Standardize column names for merging
job_agg.columns = job_agg.columns.str.lower()
house_agg.columns = house_agg.columns.str.lower()

In [7]:
district_df = pd.merge(
    job_agg,
    house_agg,
    on=["state", "district"],
    how="inner"
)

In [8]:
district_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 131 entries, 0 to 130
Data columns (total 6 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   state            131 non-null    object
 1   district         131 non-null    object
 2   avg_job_score    131 non-null    float64
 3   job_count        131 non-null    int64
 4   avg_house_score  131 non-null    float64
 5   house_count      131 non-null    int64
dtypes: float64(2), int64(2), object(2)
memory usage: 6.3+ KB

In [9]:
district_df.head()

   state      district  avg_job_score  job_count  avg_house_score  house_count
0  Johor    Ayer Hitam       0.531289          4         0.317286            2
1  Johor    Batu Pahat       0.465650         83         0.334469            9
2  Johor  Gelang Patah       0.836587         68         0.312568          125
3  Johor   Johor Bahru       0.580812        907         0.313017         1110
4  Johor        Kluang       0.519984         30         0.334725           19

Normalise the scores

In [10]:
scaler = MinMaxScaler()

district_df[["job_score_norm", "house_score_norm"]] = scaler.fit_transform(
    district_df[["avg_job_score", "avg_house_score"]]
)

Recommendation system function

In [11]:
def recommend_districts(df, job_weight, house_weight, top_k=5):
    df = df.copy()

    df["final_score"] = (
        job_weight * df["job_score_norm"] +
        house_weight * df["house_score_norm"]
    )

    return (
        df.sort_values("final_score", ascending=False)
          .head(top_k)
          [["state", "district", "final_score"]]
    )

In [12]:
#Recommend top 5 jobs in a specific district
def recommend_jobs_by_district(job_df, state, district, top_k=5):
    df = job_df.copy()

    df = df[(df["state"] == state) &(df["district"] == district)]

    return (
        df.sort_values("job_score", ascending=False).head(top_k)[
              ["title", "salary", "contract_type_name", "job_score"]
          ]
    )

In [ ]:
#Recommend top 5 houses in a specific district
def recommend_houses_by_district(house_df, state, district,top_k=5):
    df = house_df.copy()

    #If house_df and house_raw have the same number of rows, attach raw columns by index
    if 'Name' in df.columns and 'Name' in house_raw.columns and df.shape[0] == house_raw.shape[0]:
        raw_sel = house_raw[['Price','Size','Number of beds','Number of bathrooms','Type','Furnished Status','State','District']].copy()
        raw_sel = raw_sel.rename(columns={'Price':'Price_raw','Size':'Size_raw','Number of beds':'Number of beds_raw','Number of bathrooms':'Number of bathrooms_raw','Type':'Type_raw','Furnished Status':'Furnished Status_raw','State':'State_raw','District':'District_raw'})
        df = df.merge(raw_sel, left_index=True, right_index=True, how='left')

    state_col = 'State_raw' if 'State_raw' in df.columns else 'State'
    district_col = 'District_raw' if 'District_raw' in df.columns else 'District'

    df = df[(df[state_col] == state) & (df[district_col] == district)]

    df_sorted = df.sort_values('house_score', ascending=False).head(top_k).copy()

    #If both scaled (base) and raw columns exist, drop the scaled/base ones so only the raw (after-mapping) remain
    base_cols = ['Price','Size','Number of beds','Number of bathrooms','Type','Furnished Status']
    for col in base_cols:
        raw_col = f'{col}_raw'
        if raw_col in df_sorted.columns and col in df_sorted.columns:
            df_sorted = df_sorted.drop(columns=[col])

    #Rename raw columns for display when present
    col_map = {}
    if 'Price_raw' in df_sorted.columns: col_map['Price_raw'] = 'Price'
    if 'Size_raw' in df_sorted.columns: col_map['Size_raw'] = 'Size'
    if 'Number of beds_raw' in df_sorted.columns: col_map['Number of beds_raw'] = 'Number of beds'
    if 'Number of bathrooms_raw' in df_sorted.columns: col_map['Number of bathrooms_raw'] = 'Number of bathrooms'
    if 'Type_raw' in df_sorted.columns: col_map['Type_raw'] = 'Type'
    if 'Furnished Status_raw' in df_sorted.columns: col_map['Furnished Status_raw'] = 'Furnished Status'

    df_sorted = df_sorted.rename(columns=col_map)

    desired = ['Name','Price','Size','Number of beds','Number of bathrooms','Type','Furnished Status','house_score']
    cols = [c for c in desired if c in df_sorted.columns]
    return df_sorted[cols]

In [14]:
recommended_districts=recommend_districts(district_df, job_weight=0.6, house_weight=0.4, top_k=5)
recommended_districts

        state      district  final_score
10      Johor     Pengerang     0.843928
2       Johor  Gelang Patah     0.632281
125  Selangor      Serendah     0.619107
64     Pahang      Mentakab     0.571096
124  Selangor       Serdang     0.555755

In [15]:
def filter_jobs_by_preference(job_df, preferred_titles=None, min_salary=None, contract_types=None):
    df = job_df.copy()

    if preferred_titles is not None:
        df = df[df["title"].str.contains(
            "|".join(preferred_titles), case=False, na=False)]

    if min_salary is not None:
        df = df[df["salary"] >= min_salary]

    if contract_types:
        df = df[df["contract_type_name"].isin(contract_types)]

    return df

In [16]:
def recommend_jobs(job_df, preferred_titles=None, min_salary=None, contract_types=None,top_k=5):
    df = filter_jobs_by_preference(
        job_df,
        preferred_titles,
        min_salary,
        contract_types
    )

    return (
        df.sort_values("job_score", ascending=False)
          .head(top_k)[
              ["title", "salary", "contract_type_name", "state",
               "district", "job_score"]
          ]
    )

In [17]:
def filter_houses_by_preference(house_df, house_type=None, furnished_status=None, min_beds=None,
    min_baths=None, min_size=None, max_price=None):
    df = house_df.copy()

    #When house_df and house_raw have the same row-count, attach by index to preserve one-to-one mapping
    if 'Name' in df.columns and 'Name' in house_raw.columns and df.shape[0] == house_raw.shape[0]:
        raw_sel = house_raw[['Price', 'Size', 'Number of beds', 'Number of bathrooms', 'Type', 'Furnished Status', 'State', 'District']].copy()
        raw_sel = raw_sel.rename(columns={'Price':'Price_raw', 'Size':'Size_raw', 'Number of beds':'Number of beds_raw', 'Number of bathrooms':'Number of bathrooms_raw', 'Type':'Type_raw', 'Furnished Status':'Furnished Status_raw', 'State':'State_raw', 'District':'District_raw'})
        df = df.merge(raw_sel, left_index=True, right_index=True, how='left')

    #Apply filters against the original (raw) values when available
    if house_type is not None:
        if 'Type_raw' in df.columns:
            df = df[df['Type_raw'].isin(house_type)]
        else:
            df = df[df['Type'].isin(house_type)]

    if furnished_status:
        if 'Furnished Status_raw' in df.columns:
            df = df[df['Furnished Status_raw'].isin(furnished_status)]
        else:
            df = df[df['Furnished Status'].isin(furnished_status)]

    if min_beds is not None:
        beds_col = 'Number of beds_raw' if 'Number of beds_raw' in df.columns else 'Number of beds'
        df = df[pd.to_numeric(df[beds_col], errors='coerce') >= min_beds]

    if min_baths is not None:
        baths_col = 'Number of bathrooms_raw' if 'Number of bathrooms_raw' in df.columns else 'Number of bathrooms'
        df = df[pd.to_numeric(df[baths_col], errors='coerce') >= min_baths]

    if min_size is not None:
        size_col = 'Size_raw' if 'Size_raw' in df.columns else 'Size'
        df = df[pd.to_numeric(df[size_col], errors='coerce') >= min_size]

    if max_price is not None:
        price_col = 'Price_raw' if 'Price_raw' in df.columns else 'Price'
        df = df[pd.to_numeric(df[price_col], errors='coerce') <= max_price]

    return df

In [18]:
def recommend_houses(house_df, house_type=None, furnished_status=None, min_beds=None, min_baths=None,
    min_size=None, max_price=None, top_k=5):
    df = filter_houses_by_preference(
        house_df,
        house_type,
        furnished_status,
        min_beds,
        min_baths,
        min_size,
        max_price
    )

    df_sorted = df.sort_values("house_score", ascending=False).head(top_k).copy()
    base_cols = ['Price','Size','Number of beds','Number of bathrooms','Type','Furnished Status']
    for col in base_cols:
        raw_col = f'{col}_raw'
        if raw_col in df_sorted.columns and col in df_sorted.columns:
            df_sorted = df_sorted.drop(columns=[col])

    col_map = {}
    if 'Price_raw' in df_sorted.columns: col_map['Price_raw'] = 'Price'
    if 'Size_raw' in df_sorted.columns: col_map['Size_raw'] = 'Size'
    if 'Number of beds_raw' in df_sorted.columns: col_map['Number of beds_raw'] = 'Number of beds'
    if 'Number of bathrooms_raw' in df_sorted.columns: col_map['Number of bathrooms_raw'] = 'Number of bathrooms'
    if 'Type_raw' in df_sorted.columns: col_map['Type_raw'] = 'Type'
    if 'Furnished Status_raw' in df_sorted.columns: col_map['Furnished Status_raw'] = 'Furnished Status'

    df_sorted = df_sorted.rename(columns=col_map)

    desired = ['Name','Price','Size','Number of beds','Number of bathrooms','Type','Furnished Status','house_score']
    cols = [c for c in desired if c in df_sorted.columns]
    return df_sorted[cols]

In [19]:
def recommend_districts_with_preferences(job_df, house_df, job_weight=0.6, house_weight=0.4,
    top_k=5, job_filters={}, house_filters={}):
    jobs_filtered = filter_jobs_by_preference(job_df, **job_filters)
    houses_filtered = filter_houses_by_preference(house_df, **house_filters)

    job_agg = (
        jobs_filtered
        .groupby(["state", "district"])
        .job_score.mean()
        .reset_index(name="job_score")
    )

    house_agg = (
        houses_filtered
        .groupby(["State", "District"])
        .house_score.mean()
        .reset_index()
        .rename(columns={"State": "state", "District": "district"})
    )

    df = job_agg.merge(
        house_agg,
        on=["state", "district"],
        how="inner"
    )

    from sklearn.preprocessing import MinMaxScaler
    scaler = MinMaxScaler()

    df[["job_score", "house_score"]] = scaler.fit_transform(
        df[["job_score", "house_score"]]
    )

    df["final_score"] = (
        job_weight * df["job_score"] +
        house_weight * df["house_score"]
    )

    return df.sort_values("final_score", ascending=False).head(top_k)

In [20]:
for _, row in recommended_districts.iterrows():
    state = row["state"]
    district = row["district"]

    print(f"\n {district}, {state}")

    jobs = recommend_jobs_by_district(job_df, state, district, top_k=5)

    houses = recommend_houses_by_district(house_df, state, district, top_k=5)

    display(jobs)
    display(houses)

 Pengerang, Johor

,title,salary,contract_type_name,job_score
5696,Field Control Manager,12300,Contract,1.285361
5332,Mechanical Engineer,9800,Contract,1.077028
5438,Lead Document Control cum Engineering,9800,Contract,1.077028
5359,Mechanical Chief Engineer,9800,Contract,1.077028
5443,Chief Piping Engineer,9800,Contract,1.077028

,Name,Price,Size,Number of beds,Number of bathrooms,Type,Furnished Status,house_score
9922,"Pengerang, Johor",1400,1962,4.0,3.0,2-storey Terraced House,Fully Furnished,0.373348
2635,"Pengerang, Johor",1600,1585,4.0,3.0,2-storey Terraced House,Partially Furnished,0.372000
6084,"Pengerang, Johor",1500,1540,4.0,3.0,2-storey Terraced House,Fully Furnished,0.371857
11852,"Pengerang, Johor",2500,1540,4.0,3.0,2-storey Terraced House,Fully Furnished,0.371718
2388,"Pengerang, Johor",2400,1080,4.0,3.0,2-storey Terraced House,Fully Furnished,0.370122

 Gelang Patah, Johor

,title,salary,contract_type_name,job_score
5409,Senior SCM Manager-Gelang Patah (15-20K) (REF TN),180000,Permanent,15.310361
5340,Plant Manager,15000,Permanent,1.560361
5378,R&D Manager,15000,Permanent,1.560361
5394,Marketing & Sales Manager,15000,Permanent,1.560361
5652,Facility Manager,10000,Permanent,1.143694

,Name,Price,Size,Number of beds,Number of bathrooms,Type,Furnished Status,house_score
7520,"Gelang Patah, Johor",6400,1800,5.0,5.0,2-storey Terraced House,Partially Furnished,0.433197
13261,"Gelang Patah, Johor",3600,3200,5.0,4.0,Semi-Detached House,Partially Furnished,0.421820
12281,"Gelang Patah, Johor",6200,3234,5.0,4.0,Semi-Detached House,Fully Furnished,0.421577
10083,"Gelang Patah, Johor",4000,1920,4.0,5.0,Semi-Detached House,Fully Furnished,0.406173
4025,"Gelang Patah, Johor",2200,1540,4.0,4.0,2-storey Terraced House,Partially Furnished,0.388426

 Serendah, Selangor

,title,salary,contract_type_name,job_score
12077,Steam Engineer,5000,Permanent,0.727028
12362,TECHNICIAN,5000,Contract,0.634295
10871,Major Repair Mechanic (Trucks),2500,Permanent,0.518694
10980,Major Repair Mechanic (Trucks),2500,Permanent,0.518694
10897,Site Coordinator (Signage Project),2200,Permanent,0.493694

,Name,Price,Size,Number of beds,Number of bathrooms,Type,Furnished Status,house_score
13888,"Serendah, Selangor",8000,15000,4.0,4.0,Bungalow House,Fully Furnished,0.434732
13109,"Serendah, Selangor",2000,2300,4.0,5.0,3-storey Terraced House,Not Furnished,0.407781
2040,"Serendah, Selangor",950,1000,3.0,3.0,2-storey Terraced House,Not Furnished,0.342265

 Mentakab, Pahang

,title,salary,contract_type_name,job_score
1620,QUALTIY CONTROL MANAGER,5000,Permanent,0.750254
1552,PLANT ENGINEERING MAINTENANCE MANAGER,3000,Permanent,0.560361
1554,PRODUCTION PROCESS IMPROVE SPECIALIST,3000,Permanent,0.560361
1649,TikTok Affiliate Executive (Isma Cerdik Suriaa...,2000,Permanent,0.477028
1764,Pegawai Penilai (PP) / PENSYARAH KULINARI,2000,Permanent,0.477028

,Name,Price,Size,Number of beds,Number of bathrooms,Type,Furnished Status,house_score
9260,"Mentakab, Pahang",2300,6800,8.0,6.0,Bungalow House,Fully Furnished,0.551267
790,"Mentakab, Pahang",2500,1440,6.0,3.0,1.5-storey Terraced House,Fully Furnished,0.426923
6313,"Mentakab, Pahang",1200,1540,4.0,4.0,2-storey Terraced House,Not Furnished,0.388565
6349,"Mentakab, Pahang",900,1400,4.0,3.0,2-storey Terraced House,Not Furnished,0.371450
13736,"Mentakab, Pahang",600,1200,3.0,2.0,2-storey Terraced House,Not Furnished,0.326347

 Serdang, Selangor

,title,salary,contract_type_name,job_score
12119,Accounts Payable Executive,4000,Permanent,0.643694
12086,Junior Sales Tax Compliance Specialist,3500,Permanent,0.602028
10348,Eksekutif Pengurusan Risiko,3100,Contract,0.518694
11588,"Human Resource Executive (Pre School, Female P...",2500,Permanent,0.518694
11655,HR & Admin Executive,2500,Permanent,0.517238

,Name,Price,Size,Number of beds,Number of bathrooms,Type,Furnished Status,house_score
7797,"Serdang, Selangor",2500,2100,4.0,4.0,Townhouse,Fully Furnished,0.390345

In [21]:
recommend_jobs(
    job_df,
    preferred_titles=["Sales"],
    min_salary=5000,
    contract_types=["Permanent"],
    top_k=5
)

,title,salary,contract_type_name,state,district,job_score
8912,Japanese Market Renewal Sales Specialist,122500,Permanent,W.P. Kuala Lumpur,Kuala Lumpur,10.518694
8623,Head of Sales n Business Development,20000,Permanent,W.P. Kuala Lumpur,Kuala Lumpur,1.977028
9753,Head of International Sales -Food (Puchong) (1...,20000,Permanent,Selangor,Puchong,1.977028
8744,Sales Director,18000,Permanent,W.P. Kuala Lumpur,Kuala Lumpur,1.810361
3387,Deputy Director of Sales,18000,Permanent,Sabah,Kota Kinabalu,1.810361

In [22]:
recommend_jobs(
    job_df,
    top_k=5
)

,title,salary,contract_type_name,state,district,job_score
7764,ACCOUNT EXECUTIVE,300000,Permanent,W.P. Kuala Lumpur,Kuala Lumpur,25.548590
5339,Admin Assistant,190000,Permanent,Johor,Johor Bahru,16.217862
5409,Senior SCM Manager-Gelang Patah (15-20K) (REF TN),180000,Permanent,Johor,Gelang Patah,15.310361
2794,GENERAL WORKER,170000,Permanent,Sabah,Kota Kinabalu,14.638590
54,PEKERJA AM,170000,Contract,Kedah,Sungai Petani,14.616957

In [23]:
recommend_houses(
    house_df,
    house_type=["2-storey Terraced House"],
    furnished_status=["Fully Furnished"],
    min_beds=2,
    max_price=2500,
    top_k=5
)

,Name,Price,Size,Number of beds,Number of bathrooms,Type,Furnished Status,house_score
1490,"Telok Panglima Garang, Selangor",2500,2600,5.0,5.0,2-storey Terraced House,Fully Furnished,0.436539
11944,"Ayer Keroh, Melaka",1700,1540,5.0,4.0,2-storey Terraced House,Fully Furnished,0.416273
10212,"Kulai, Johor",2400,1560,5.0,4.0,2-storey Terraced House,Fully Furnished,0.416246
7615,"Klebang, Melaka",2000,1540,5.0,4.0,2-storey Terraced House,Fully Furnished,0.416232
9277,"Ipoh, Perak",2040,1500,5.0,4.0,2-storey Terraced House,Fully Furnished,0.416086

In [24]:
recommend_houses(
    house_df,
    top_k=5
)

,Name,Price,Size,Number of beds,Number of bathrooms,Type,Furnished Status,house_score
10880,"Bukit Baru, Melaka",650,99999,3.0,2.0,Others,Not Furnished,0.672144
7154,"Johor Bahru, Johor",3500,5000,10.0,10.0,Semi-Detached House,Fully Furnished,0.667023
5631,"Old Klang Road, Kuala Lumpur",15000,11500,10.0,5.0,Bungalow House,Not Furnished,0.604842
2790,"Bangi, Selangor",4000,17000,7.0,8.0,Bungalow House,Not Furnished,0.592287
7662,"Ipoh, Perak",10000,5477,8.0,8.0,Bungalow House,Fully Furnished,0.578900

In [25]:
district_df.to_csv('district_scores.csv')